{
    "chars": [
        "\n",
        " ",
        "!",
        "\"",
        "(",
        ")",
        ",",
        "-",
        ".",
        "0",
        "1",
        "2",
        "7",
        "8",
        "9",
        ":",
        "?",
        "a",
        "b",
        "c",
        "d",
        "e",
        "f",
        "g",
        "h",
        "i",
        "j",
        "k",
        "l",
        "m",
        "n",
        "o",
        "p",
        "r",
        "s",
        "t",
        "u",
        "v",
        "w",
        "x",
        "y",
        "z",
        "â",
        "î",
        "ă",
        "ş",
        "ș",
        "ț",
        "…"
    ],
    "char2idx": {
        "\n": 0,
        " ": 1,
        "!": 2,
        "\"": 3,
        "(": 4,
        ")": 5,
        ",": 6,
        "-": 7,
        ".": 8,
        "0": 9,
        "1": 10,
        "2": 11,
        "7": 12,
        "8": 13,
        "9": 14,
        ":": 15,
        "?": 16,
        "a": 17,
        "b": 18,
        "c": 19,
        "d": 20,
        "e": 21,
        "f": 22,
        "g": 23,
        "h": 24,
        "i": 25,
        "j": 26,
        "k": 27,
        "l": 28,
        "m": 29,
        "n": 30,
        "o": 31,
        "p": 32,
        "r": 33,
        "s": 34,
        "t": 35,
        "u": 36,
        "v": 37,
        "w": 38,
        "x": 39,
        "y": 40,
        "z": 41,
        "â": 42,
        "î": 43,
        "ă": 44,
        "ş": 45,
        "ș": 46,
        "ț": 47,
        "…": 48
    },
    "idx2char": {
        "0": "\n",
        "1": " ",
        "2": "!",
        "3": "\"",
        "4": "(",
        "5": ")",
        "6": ",",
        "7": "-",
        "8": ".",
        "9": "0",
        "10": "1",
        "11": "2",
        "12": "7",
        "13": "8",
        "14": "9",
        "15": ":",
        "16": "?",
        "17": "a",
        "18": "b",
        "19": "c",
        "20": "d",
        "21": "e",
        "22": "f",
        "23": "g",
        "24": "h",
        "25": "i",
        "26": "j",
        "27": "k",
        "28": "l",
        "29": "m",
        "30": "n",
        "31": "o",
        "32": "p",
        "33": "r",
        "34": "s",
        "35": "t",
        "36": "u",
        "37": "v",
        "38": "w",
        "39": "x",
        "40": "y",
        "41": "z",
        "42": "â",
        "43": "î",
        "44": "ă",
        "45": "ş",
        "46": "ș",
        "47": "ț",
        "48": "…"
    }
}