{
    "chars": [
        "\n",
        " ",
        "!",
        "\"",
        "(",
        ")",
        ",",
        "-",
        ".",
        "0",
        "1",
        "8",
        "9",
        ":",
        "?",
        "a",
        "b",
        "c",
        "d",
        "e",
        "f",
        "g",
        "h",
        "i",
        "j",
        "k",
        "l",
        "m",
        "n",
        "o",
        "p",
        "r",
        "s",
        "t",
        "u",
        "v",
        "x",
        "z",
        "â",
        "î",
        "ă",
        "ş",
        "ș",
        "ț",
        "…"
    ],
    "char2idx": {
        "\n": 0,
        " ": 1,
        "!": 2,
        "\"": 3,
        "(": 4,
        ")": 5,
        ",": 6,
        "-": 7,
        ".": 8,
        "0": 9,
        "1": 10,
        "8": 11,
        "9": 12,
        ":": 13,
        "?": 14,
        "a": 15,
        "b": 16,
        "c": 17,
        "d": 18,
        "e": 19,
        "f": 20,
        "g": 21,
        "h": 22,
        "i": 23,
        "j": 24,
        "k": 25,
        "l": 26,
        "m": 27,
        "n": 28,
        "o": 29,
        "p": 30,
        "r": 31,
        "s": 32,
        "t": 33,
        "u": 34,
        "v": 35,
        "x": 36,
        "z": 37,
        "â": 38,
        "î": 39,
        "ă": 40,
        "ş": 41,
        "ș": 42,
        "ț": 43,
        "…": 44
    },
    "idx2char": {
        "0": "\n",
        "1": " ",
        "2": "!",
        "3": "\"",
        "4": "(",
        "5": ")",
        "6": ",",
        "7": "-",
        "8": ".",
        "9": "0",
        "10": "1",
        "11": "8",
        "12": "9",
        "13": ":",
        "14": "?",
        "15": "a",
        "16": "b",
        "17": "c",
        "18": "d",
        "19": "e",
        "20": "f",
        "21": "g",
        "22": "h",
        "23": "i",
        "24": "j",
        "25": "k",
        "26": "l",
        "27": "m",
        "28": "n",
        "29": "o",
        "30": "p",
        "31": "r",
        "32": "s",
        "33": "t",
        "34": "u",
        "35": "v",
        "36": "x",
        "37": "z",
        "38": "â",
        "39": "î",
        "40": "ă",
        "41": "ş",
        "42": "ș",
        "43": "ț",
        "44": "…"
    }
}